#include<stdio.h>
int z=1;

void func(int *x){ //xをポインタでもってくる
  static int y=8; // func内でyを定義する
  extern int z; //グローバル変数zを定義する
  printf("%d,%d,%d\n",(*x)++,y++,z++); //xは引数依存、yは8から増加、zは関数が日出された時のz依存、それぞれ表示された後にプラス1
}

int main(void){
  int x=2, y=5, z=4;
  func(&y); //yのポインタを引き渡すためxは5、yは1度目の呼び出しであるため8、zはexternで定義されたグローバル変数であるため、その前に定義されたzの値1をそれぞれ表示後プラス１
  printf("%d,%d,%d\n",x++,y++,z++); // x、zは定義した2、4、yは前文の関数でプラス1しているため6、それぞれを表示後プラス１
  func(&z); //main文のzのポインタを渡すためxは5、yは2度目の呼び出しであるため9、zはグローバル変数であるため2、それぞれを表示後プラス１
  printf("%d,%d,%d\n",x++,y++,z++); //x、yは前のprintf文の値を引き継ぐため3、7、zは前の関数内でプラス１されているため6
  return(0);
}
